"""
Файл с настройками игры.
"""

import pygame as pg

# Настройка игры
TILE = 38
TILE_SUP = TILE / 2
WIDTH = 10
HEIGTH = 20
GAME_WINDOWS = WIDTH * TILE, HEIGTH * TILE
WINDOWS = 770, 770
FPS = 60

# Цвета
WHITE = (255, 255, 255)
CYAN = (0, 255, 255)
RED = (255, 0, 0)
GOLD = (255, 215, 0)
BACKGROUND = (30, 30, 30)
GRID = (40, 40, 40)

# Шрифты
pg.init()
FONT_MAIN = pg.font.SysFont('Corbel', 40)
FONT_TITLE = pg.font.Font('Grand9K_Pixel.ttf', 60)

# Фигуры
FIGURES_COLOR = [(18, 144, 226), (254, 191, 16), (35, 166, 60),
                 (233, 0, 31), (48, 47, 186), (252, 105, 30), (144, 48, 146)]

FIGURES_POS = [[(-1, 0), (-2, 0), (0, 0), (1, 0)],  # I
               [(0, -1), (-1, -1), (-1, 0), (0, 0)],  # O
               [(-1, 0), (-1, 1), (0, 0), (0, -1)],  # S
               [(0, 0), (-1, 0), (0, 1), (-1, -1)],  # Z
               [(0, 0), (0, -1), (0, 1), (-1, -1)],  # J
               [(0, 0), (0, -1), (0, 1), (1, -1)],  # L
               [(0, 0), (0, -1), (0, 1), (-1, 0)]]  # T
